// Вывести квадрат числа

Console.Clear();
double a, sqw=0;
string s;
Console.Write("Введите число, которое необходимо возвести в квадрат а=");
s=Console.ReadLine();
a=Convert.ToDouble(s);

sqw=a*a;
System.Console.WriteLine("Квадрат заданного числа: {0}", sqw);